(nlp) ➜  acordoes_analise_sentimentos git:(master) ✗ python model_train.py
Using TensorFlow backend.
Max document length: 222
Vocabulary size: 3896
(1504, 222)
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to
==================================================================================================
input_1 (InputLayer)            (None, 222)          0
__________________________________________________________________________________________________
input_2 (InputLayer)            (None, 222)          0
__________________________________________________________________________________________________
input_3 (InputLayer)            (None, 222)          0
__________________________________________________________________________________________________
embedding_1 (Embedding)         (None, 222, 100)     389600      input_1[0][0]
__________________________________________________________________________________________________
embedding_2 (Embedding)         (None, 222, 100)     389600      input_2[0][0]
__________________________________________________________________________________________________
embedding_3 (Embedding)         (None, 222, 100)     389600      input_3[0][0]
__________________________________________________________________________________________________
conv1d_1 (Conv1D)               (None, 219, 32)      12832       embedding_1[0][0]
__________________________________________________________________________________________________
conv1d_2 (Conv1D)               (None, 217, 32)      19232       embedding_2[0][0]
__________________________________________________________________________________________________
conv1d_3 (Conv1D)               (None, 215, 32)      25632       embedding_3[0][0]
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 219, 32)      0           conv1d_1[0][0]
__________________________________________________________________________________________________
dropout_2 (Dropout)             (None, 217, 32)      0           conv1d_2[0][0]
__________________________________________________________________________________________________
dropout_3 (Dropout)             (None, 215, 32)      0           conv1d_3[0][0]
__________________________________________________________________________________________________
max_pooling1d_1 (MaxPooling1D)  (None, 109, 32)      0           dropout_1[0][0]
__________________________________________________________________________________________________
max_pooling1d_2 (MaxPooling1D)  (None, 108, 32)      0           dropout_2[0][0]
__________________________________________________________________________________________________
max_pooling1d_3 (MaxPooling1D)  (None, 107, 32)      0           dropout_3[0][0]
__________________________________________________________________________________________________
flatten_1 (Flatten)             (None, 3488)         0           max_pooling1d_1[0][0]
__________________________________________________________________________________________________
flatten_2 (Flatten)             (None, 3456)         0           max_pooling1d_2[0][0]
__________________________________________________________________________________________________
flatten_3 (Flatten)             (None, 3424)         0           max_pooling1d_3[0][0]
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 10368)        0           flatten_1[0][0]
                                                                 flatten_2[0][0]
                                                                 flatten_3[0][0]
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 10)           103690      concatenate_1[0][0]
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 1)            11          dense_1[0][0]
==================================================================================================
Total params: 1,330,197
Trainable params: 1,330,197
Non-trainable params: 0
__________________________________________________________________________________________________
None
Epoch 1/10
2018-10-21 19:47:42.232992: I tensorflow/core/platform/cpu_feature_guard.cc:141] Your CPU supports instructions that this TensorFlow binary was not compiled touse: AVX2 FMA
1504/1504 [==============================] - 11s 7ms/step - loss: 0.4133 - acc: 0.8112
Epoch 2/10
1504/1504 [==============================] - 9s 6ms/step - loss: 0.1960 - acc: 0.9315
Epoch 3/10
1504/1504 [==============================] - 9s 6ms/step - loss: 0.1400 - acc: 0.9794
Epoch 4/10
1504/1504 [==============================] - 9s 6ms/step - loss: 0.1212 - acc: 0.9947
Epoch 5/10
1504/1504 [==============================] - 9s 6ms/step - loss: 0.1127 - acc: 0.9973
Epoch 6/10
1504/1504 [==============================] - 9s 6ms/step - loss: 0.1062 - acc: 0.9967
Epoch 7/10
1504/1504 [==============================] - 9s 6ms/step - loss: 0.0981 - acc: 0.9993
Epoch 8/10
1504/1504 [==============================] - 13s 8ms/step - loss: 0.0934 - acc: 0.9987
Epoch 9/10
1504/1504 [==============================] - 11s 7ms/step - loss: 0.0873 - acc: 0.9993
Epoch 10/10
1504/1504 [==============================] - 12s 8ms/step - loss: 0.0823 - acc: 0.9993