Using TensorFlow backend.
Max document length: 260
Vocabulary size: 2834
(2881, 260)
Number of Y classes: 4
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to
==================================================================================================
input_1 (InputLayer)            (None, 260)          0
__________________________________________________________________________________________________
input_2 (InputLayer)            (None, 260)          0
__________________________________________________________________________________________________
input_3 (InputLayer)            (None, 260)          0
__________________________________________________________________________________________________
embedding_1 (Embedding)         (None, 260, 100)     283400      input_1[0][0]
__________________________________________________________________________________________________
embedding_2 (Embedding)         (None, 260, 100)     283400      input_2[0][0]
__________________________________________________________________________________________________
embedding_3 (Embedding)         (None, 260, 100)     283400      input_3[0][0]
__________________________________________________________________________________________________
conv1d_1 (Conv1D)               (None, 257, 32)      12832       embedding_1[0][0]
__________________________________________________________________________________________________
conv1d_2 (Conv1D)               (None, 255, 32)      19232       embedding_2[0][0]
__________________________________________________________________________________________________
conv1d_3 (Conv1D)               (None, 253, 32)      25632       embedding_3[0][0]
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 257, 32)      0           conv1d_1[0][0]
__________________________________________________________________________________________________
dropout_2 (Dropout)             (None, 255, 32)      0           conv1d_2[0][0]
__________________________________________________________________________________________________
dropout_3 (Dropout)             (None, 253, 32)      0           conv1d_3[0][0]
__________________________________________________________________________________________________
max_pooling1d_1 (MaxPooling1D)  (None, 128, 32)      0           dropout_1[0][0]
__________________________________________________________________________________________________
max_pooling1d_2 (MaxPooling1D)  (None, 127, 32)      0           dropout_2[0][0]
__________________________________________________________________________________________________
max_pooling1d_3 (MaxPooling1D)  (None, 126, 32)      0           dropout_3[0][0]
__________________________________________________________________________________________________
flatten_1 (Flatten)             (None, 4096)         0           max_pooling1d_1[0][0]
__________________________________________________________________________________________________
flatten_2 (Flatten)             (None, 4064)         0           max_pooling1d_2[0][0]
__________________________________________________________________________________________________
flatten_3 (Flatten)             (None, 4032)         0           max_pooling1d_3[0][0]
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 12192)        0           flatten_1[0][0]
                                                                 flatten_2[0][0]
                                                                 flatten_3[0][0]
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 10)           121930      concatenate_1[0][0]
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 4)            44          dense_1[0][0]
==================================================================================================
Total params: 1,029,870
Trainable params: 1,029,870
Non-trainable params: 0
__________________________________________________________________________________________________
None
Epoch 1/7
2019-02-06 16:34:07.929648: I tensorflow/core/platform/cpu_feature_guard.cc:141] Your CPU supports instructions that this TensorFlow binary was not compiled to use: AVX2 FMA
2881/2881 [==============================] - 19s 7ms/step - loss: 0.1513 - categorical_accuracy: 0.8907
Epoch 2/7
2881/2881 [==============================] - 18s 6ms/step - loss: 0.0710 - categorical_accuracy: 0.9403
Epoch 3/7
2881/2881 [==============================] - 21s 7ms/step - loss: 0.0442 - categorical_accuracy: 0.9698
Epoch 4/7
2881/2881 [==============================] - 19s 7ms/step - loss: 0.0254 - categorical_accuracy: 0.9820
Epoch 5/7
2881/2881 [==============================] - 18s 6ms/step - loss: 0.0139 - categorical_accuracy: 0.9913
Epoch 6/7
2881/2881 [==============================] - 18s 6ms/step - loss: 0.0107 - categorical_accuracy: 0.9927
Epoch 7/7
2881/2881 [==============================] - 20s 7ms/step - loss: 0.0066 - categorical_accuracy: 0.9979